export const contents = [
  {
    imageSrc: 'logo.jpg',
    title: 'ロゴのコンセプト',
    text: 'ロゴは「喜」の草書体「㐂」をモチーフに、日本の歴史的建造物と馴染み深い白銀比を織り込み創りました。これからも喜びが多く美しいモノ創りに努めて参ります。',
  },
  {
    imageSrc: 'profile.jpg',
    title: 'プロフィール',
    text: '西條友喜（さいじょうともき）。1992年、神奈川県横浜市出身。フロントエンドエンジニア。趣味はイタリアン料理など。幾度と作ったパスタは感覚で100gを計量可能。',
  },
  {
    imageSrc: 'skill.jpg',
    title: '力になれること',
    text: 'HP作成やWebアプリ開発など。本職を活かしノーコードツールからJavaScriptまで幅広く扱い、皆様が想いを込めたビジネスやアート等を世に出すお手伝いをします。',
  },
  {
    imageSrc: 'work.jpg',
    title: '作ってきたもの',
    text: '最近は知人の紹介で写真展のHPを作成しました。LINEで会話しながらUIデザインからサイト制作、文言作成、画像編集まで対応し、とても喜んでいただけました。',
  },
  {
    imageSrc: 'contact.jpg',
    title: 'お問い合わせ',
    text: 'サイト制作のご相談などはInstagram、カジュアル面談のお誘いなどはWantedlyにてご連絡ください。なお、現在サイト制作はご紹介でのみ承っております。',
  },
];
