export const career = [
  {
    year: '2015',
    cover: 'brain.jpg',
    organization: '中央大学大学院理工学研究科経営システム工学専攻',
    job: 'ニューロマーケティング（脳科学と経営学の融合分野）に関する研究',
    detail:
      '学部生時代に経営システム工学分野においてヒト・モノ・カネ・情報を勉強する中で人間の感性を分析することに興味を持つ。人間の心理評価法としてはアンケートやインタビューが一般的だったが、それらは忖度や余計な情報のノイズ等の要因により回答者の心理状態を正確に知り得ないといった問題点もあり、代わるアプローチとして脳活動計測を採用。研究分野としては脳科学の見地から消費者の心理を分析し経営に応用する「ニューロマーケティング」となる。当時は学内に脳活動計測の機器こそあったが実験計画や分析手法に関するノウハウはまだ少なく、ほぼゼロベースでのスタートとなった。実験計画の過程では、当初計画していた実験方法の妥当性を評価する予備研究を行い原著論文を執筆。査読にて分析手法の妥当性に指摘を受けたが、分析方法の方向転換を以て学会誌への論文掲載へ至る。当時からヒトについて知ることに並びモノを作ることも好きであり、実験に必要な画像・映像を提示して印象評価してもらうためのシステムをJavaScriptで自作するなどの取り組みも行っていた。',
  },
  {
    year: '2017',
    cover: 'html.jpg',
    organization: '株式会社Agoop（ソフトバンク株式会社より出向）',
    job: 'toC アプリの企画・要件定義や通信ログ収集モジュールの精度検証・他部署折衝',
    detail:
      '幅広いIT分野で自分が本当にやりたいことを見つけるため、またアニメーション映画「サマーウォーズ」のような電子の世界で生活のあらゆることが完結する世界を実現したいという思いから、当時より巨大な商圏プラットフォーム実現を計画していたソフトバンクへ入社。新卒研修後はソフトバンクの子会社で位置情報データを扱うAgoopへ出向。初年度はtoCサービスの企画や要件定義に従事。そこでペルソナを設定した上での企画立案方法やiOS仕様を理解した上での企画実現方法について学んだ。次年度は通信速度計測モジュールの精度検証やソフトバンクとの折衝に従事。検証作業は大量のデータを手動でExcelに入力したり、検査項目の合否を目視で判定したりと非効率的で検証工数は膨大なものであった。検証や折衝といった仕事の傍ら開発業務に興味を持ち、どうせモノづくりするなら役立つ便利なモノをとPythonを利用した検証自動化ツールを開発。これを皮切りに部署一丸となって検証工数を削減する取り組みが開始した。上司に開発業務を経験したいと伝えていたところ翌年度にソフトバンクへ帰任。自社サービスを開発している部門への配置転換へ至った。',
  },
  {
    year: '2019',
    cover: 'csm.png',
    organization: 'ソフトバンク株式会社',
    job: '自社 MLOps サービスのマネージメントコンソールとしてフロントエンド・BFF開発',
    detail:
      'ソフトバンク帰任後はデータ流通系Webアプリのフロントエンド開発や産学連携ヘルスケア系iOSアプリの企画開発を担当。後者のプロト開発にてReactNativeによるアプリ開発とチームリーダーないしスクラムマスターに従事していたが、PJ中止に伴い前者のフロントエンド開発に注力。当時のフロントエンドは初学者３名という開発体制。機能追加の度に多くのコンポーネントで改修を要したり、AtomicDesignを採用するもAtomが条件分岐のスパゲッティコードになったりといった状況。試行錯誤していたが、PJ計画変更に伴いフロントエンドが不要となり開発は打ち切りとなる。その後エンジニアやスクラムマスターとして如何にすれば良いプロダクト作りができるだろうかと体系的な勉強のため、部門の資格取得支援制度を利用しScrumAllianceの研修を受講。認定スクラムマスター「CSM」の資格を取得。現在はMLOpsサービスのマネージメントコンソールとしてフロントエンドを開発。チームメンバーのPJ掛け持ちにより教科書的なスクラム開発はできない、またいつどんな形でPJや開発が打ち切りとなるか分からない。そのようなリスクはあるが、今日もまだ見ぬユーザーに喜ばれるサービス開発に尽力している。',
  },
];

// import { Box } from '@chakra-ui/react';

// export const useHistory = () => {
//   const from2015 = () => (
//     <Box w="100%">
//       <p>
//         学部生時代に経営システム工学分野においてヒト・モノ・カネ・情報を勉強する中で人間の感性を分析することに興味を持つ。
//       </p>
//       <p>
//         人間の心理評価法としてはアンケートやインタビューが一般的だったが、それらは忖度や余計な情報のノイズ等の要因により回答者の心理状態を正確に知り得ないといった問題点もあり、代わるアプローチとして脳活動計測を採用。
//       </p>
//       <p>
//         研究分野としては脳科学の見地から消費者の心理を分析し経営に応用する「ニューロマーケティング」となる。当時は学内に脳活動計測の機器こそあったが実験計画や分析手法に関するノウハウはまだ少なく、ほぼゼロベースでのスタートとなった。
//       </p>
//       <p>
//         実験計画の過程では、当初計画していた実験方法の妥当性を評価する予備研究を行い原著論文を執筆。査読にて分析手法の妥当性に指摘を受けたが、分析方法の方向転換を以て学会誌への論文掲載へ至る。当時からヒトについて知ることに並びモノを作ることも好きであり、実験に必要な画像・映像を提示して印象評価してもらうためのシステムをJavaScriptで自作するなどの取り組みも行っていた。
//       </p>
//     </Box>
//   );

//   const from2017 = () => (
//     <Box>
//       <p>
//         幅広いIT分野で自分が本当にやりたいことを見つけるため、またアニメーション映画「サマーウォーズ」のような電子の世界で生活のあらゆることが完結する世界を実現したいという思いから、当時より巨大な商圏プラットフォーム実現を計画していたソフトバンクへ入社。
//       </p>
//       <p>
//         新卒研修後はソフトバンクの子会社で位置情報データを扱うAgoopへ出向。初年度はtoCサービスの企画や要件定義に従事。そこでペルソナを設定した上での企画立案方法やiOS仕様を理解した上での企画実現方法について学んだ。
//       </p>
//       <p>
//         次年度は通信速度計測モジュールの精度検証やソフトバンクとの折衝に従事。検証作業は大量のデータを手動でExcelに入力したり、検査項目の合否を目視で判定したりと非効率的で検証工数は膨大なものであった。
//       </p>
//       <p>
//         検証や折衝といった仕事の傍ら開発業務に興味を持ち、どうせモノづくりするなら役立つ便利なモノをとPythonを利用した検証自動化ツールを開発。これを皮切りに部署一丸となって検証工数を削減する取り組みが開始した。
//       </p>
//       <p>
//         上司に開発業務を経験したいと伝えていたところ翌年度にソフトバンクへ帰任。自社サービスを開発している部門への配置転換へ至った。
//       </p>
//     </Box>
//   );

//   const from2019 = () => (
//     <Box>
//       <p>
//         ソフトバンク帰任後はデータ流通系Webアプリのフロントエンド開発や産学連携ヘルスケア系iOSアプリの企画開発を担当。後者のプロト開発にてReactNativeによるアプリ開発とチームリーダーないしスクラムマスターに従事していたが、PJ中止に伴い前者のフロントエンド開発に注力。
//       </p>
//       <p>
//         当時のフロントエンドは初学者３名という開発体制。機能追加の度に多くのコンポーネントで改修を要したり、AtomicDesignを採用するもAtomが条件分岐のスパゲッティコードになったりといった状況。試行錯誤していたが、PJ計画変更に伴いフロントエンドが不要となり開発は打ち切りとなる。
//       </p>
//       <p>
//         その後エンジニアやスクラムマスターとして如何にすれば良いプロダクト作りができるだろうかと体系的な勉強のため、部門の資格取得支援制度を利用しScrumAllianceの研修を受講。認定スクラムマスター「CSM」の資格を取得。
//       </p>
//       <p>
//         現在はMLOpsサービスのマネージメントコンソールとしてフロントエンドを開発。チームメンバーのPJ掛け持ちにより教科書的なスクラム開発はできない、またいつどんな形でPJや開発が打ち切りとなるか分からない。そのようなリスクはあるが、今日もまだ見ぬユーザーに喜ばれるサービス開発に尽力している。
//       </p>
//     </Box>
//   );

//   const career = [
//     {
//       year: '2015',
//       cover: 'brain.jpg',
//       organization: '中央大学大学院理工学研究科経営システム工学専攻',
//       job: 'ニューロマーケティング（脳科学と経営学の融合分野）に関する研究',
//       detail: from2015,
//     },
//     {
//       year: '2017',
//       cover: 'html.jpg',
//       organization: '株式会社Agoop（ソフトバンク株式会社より出向）',
//       job: 'toC アプリの企画・要件定義や通信ログ収集モジュールの精度検証・他部署折衝',
//       detail: from2017,
//     },
//     {
//       year: '2019',
//       cover: 'csm.png',
//       organization: 'ソフトバンク株式会社',
//       job: '自社 MLOps サービスのマネージメントコンソールとしてフロントエンド・BFF開発',
//       detail: from2019,
//     },
//   ];

//   return career;
// };
